---
kind: method
id: M:Autodesk.Revit.DB.OBJExportOptions.IsGridAspectRatioSet
source: html/5d2857ac-200f-30c9-278c-65184fa75ca9.htm
---
# Autodesk.Revit.DB.OBJExportOptions.IsGridAspectRatioSet Method

Checks whether the GridAspectRatio tessellation parameter is explicitly set.

## Syntax (C#)
```csharp
public bool IsGridAspectRatioSet()
```

## Returns
True if GridAspectRatio tessellation parameter is explicitly set, false otherwise.